----------------------------------------------------------------------
-- Author: jaron.ho
-- Date: 2015-02-02
-- Brief: 枚举定义
----------------------------------------------------------------------
-- 奖励类型
AwardType = {
	["item"] = 1,			-- 物品
	["hero"] = 2,			-- 英雄
	["giftbag"] = 3,		-- 礼包
}

-- 音频类型
AudioType = {
	["music"] = 1,			-- 音乐
	["effect"] = 2,			-- 音效
}

-- 目标类型
GoalType = {
	["none"] = 0,			-- 无
	["collect"] = 1,		-- 收集元素/物品
	["kill"] = 2,			-- 击杀怪物
}

-- 中间界面物品类型
ItemType = {
	["ball"] = 1,			-- 毛球（饼干）
	["cookie"] = 2,			-- 饼干（棒棒糖）
	["dia"] = 3,			-- 砖石
	["power"] = 4,			-- 体力
	["maxpower"] = 5,		-- 体力上限
	["key"] = 6,			-- 钥匙
}

-- 加减符号类型
SignType = {
	["add"] = "+",			-- 增加
	["reduce"] = "-",		-- 减少
}

-- 关卡类型
CopyType = {
	["normal"] = 1,			-- 普通关卡
	["speical"] = 2,		-- 特殊关卡
}
